{"jobs":[{"id":"full-stack-developer-garoo","title":"Full-Stack Developer","recommended":false,"pinned":true,"is_hot":true,"salary":"2200 - 4000","description":"\u003cdiv\u003eBuscamos a alguien con pasión por la innovación aplicada al aprendizaje para sumarse al equipo de ingeniería. Nuestro stack es Amazon Web Services, PostgreSQL, Ruby on Rails, React y React Native por lo que la experiencia demostrable en este es necesaria. Pero más que conocer estas tecnologías, buscamos un(a) profesional políglota, capaz de plantear soluciones desde la arquitectura hasta la implementación. Los desafíos actuales son del tipo Analíticas, Dashboard, Machine Learning, Mobile, entre otros.\u003c/div\u003e\u003cdiv\u003eNo nos importa si tienes un cartón profesional o si lo aprendiste a punta de stackoverflow, pero sólidos fundamentos en ingeniería de software son necesarios. Esperamos que al menos 3 de tus años laborales hayan sido construyendo software en equipo, ya sea productos o servicios (SaaS).\u003c/div\u003e","functions":"\u003cdiv\u003eTrabajarías con un equipo pequeño de desarrolladores y diseñadores planificando sprints, estimando esfuerzos, desarrollando funcionalidades, corrigiendo bugs, creando tests, realizando code review del equipo, etc, etc. Es decir, queremos un team player que disfrute lograr cosas en equipo.\u003c/div\u003e","benefits":"\u003cul\u003e\u003cli\u003e\u003cstrong\u003eTrabajamos por objetivos: \u003c/strong\u003eEn Nivelat el horario es flexible y el trabajo remoto está OK. Con límites. Por lo mismo solo contratamos personas capaces de autogestionarse y que cumplan sus compromisos.\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eDecidimos horizontalmente: \u003c/strong\u003eEstamos desarrollando un producto innovador que nunca se ha hecho antes, por lo que no creemos en los iluminados “dueños de la verdad”\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eAprende siempre: \u003c/strong\u003eSomos una comunidad de aprendizaje y queremos que siempre estés desarrollando tu potencial. Los cursos online y los libros en Kindle que necesites corren por cuenta de la empresa.\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eNuestros usuarios son lo más importante: \u003c/strong\u003eSomos obsesivos por lograr que la experiencia de nuestros usuarios sea ridículamente buena y todos somos responsables de esta tarea.\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eRespeto ante todo: \u003c/strong\u003eEstamos muy comprometidos en generar espacios libre de acoso y discriminación. Promovemos activamente un entorno de colaboración libre de juicios, bullying y egocentrismo para que puedas desarrollar todo tu talento de forma abierta, cómoda y segura.\u003c/li\u003e\u003c/ul\u003e","remote":false,"city":"Santiago","country":"Chile","country_flag_url":"https://d2dgum4gsvdsrq.cloudfront.net/assets/flags/cl_mini-43732ca1dce0306aebced22a6205cb8bab0d2747005d1154a045776ba5aea7a9.png","new":false,"seniority":"Semi Senior","logo_url":"https://getonbrd-prod.s3.amazonaws.com/uploads/users/logo/4734/icon.png","url":"/empleos/programacion/full-stack-developer-garoo","modality":"Full time","published_at":"nov 26","company":{"name":"Nivelat","about":"Videojuegos + Aprendizaje para desarrollar el potencial de las personas","url":"/companies/nivelat"}},{"id":"rails-and-react-full-stack-developer-get-on-board-remoto","title":"Rails and React Full-Stack Developer","recommended":false,"pinned":true,"is_hot":true,"salary":"4200 - 5000","description":"\u003cp\u003e\u003cstrong\u003eOur tech stack includes: \u003c/strong\u003eA \u003cem\u003eRuby on Rails\u003c/em\u003e backend app, a hybrid \u003cem\u003eHaml\u003c/em\u003e/\u003cem\u003eVanilla JS\u003c/em\u003e/\u003cem\u003eReact\u003c/em\u003e front app, \u003cem\u003ePostgreSQL\u003c/em\u003e and \u003cem\u003eRedis\u003c/em\u003e databases, \u003cem\u003eMemCache\u003c/em\u003e servers and \u003cem\u003eSidekiq\u003c/em\u003e for background jobs. It then integrates with \u003cem\u003eAmazon S3\u003c/em\u003e, \u003cem\u003eCloudFront\u003c/em\u003e, \u003cem\u003eAmazon SES\u003c/em\u003e, \u003cem\u003eMixpanel\u003c/em\u003e, \u003cem\u003eStripe\u003c/em\u003e and \u003cem\u003ePaypal\u003c/em\u003e. In order to make it hybrid it renders \u003cem\u003eHTML\u003c/em\u003e using \u003cem\u003eHAML\u003c/em\u003e and uses w\u003cem\u003eebpack\u003c/em\u003e to compile and expose the components in \u003cem\u003eReact\u003c/em\u003e.\u003c/p\u003e\u003cp\u003eWe care about \u003cstrong\u003eexpertise\u003c/strong\u003e and that is different from experience —there are a lot of experienced yet not-expert devs out there— although it adds up. We never stop learning —and you will learn a lot by joining us— but when it comes to the list below, we assume you are a 10th dan black-belt that can teach us about:\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cem\u003eRuby\u003c/em\u003e and \u003cem\u003eRoR\u003c/em\u003e, \u003cem\u003eJavaScript\u003c/em\u003e and \u003cem\u003eReact\u003c/em\u003e. You are very proficient and kind of obsessive with performance and legibility\u003c/li\u003e\u003cli\u003e\u003cem\u003eGit\u003c/em\u003e commands and git workflow. We discuss a lot over \u003cem\u003eGithub\u003c/em\u003e\u003c/li\u003e\u003cli\u003e\u003cem\u003ePostgreSQL\u003c/em\u003e. It is not enough to know some \u003cem\u003eSQL\u003c/em\u003e, it is imperative you are able to write complex queries when the abstraction of \u003cem\u003eActive Record\u003c/em\u003e is not enough\u003c/li\u003e\u003cli\u003e How to design and build a \u003cem\u003eRESTAPI\u003c/em\u003e. You are capable to explain everything that happens under the hood when an user (agent) requests an \u003cem\u003eURL\u003c/em\u003e\u003c/li\u003e\u003cli\u003e Encapsulation, abstraction, polymorphism, algorithms\u003c/li\u003e\u003cli\u003e Functional programming as a form of creating reactive programming\u003c/li\u003e\u003cli\u003e Excellent written and verbal communication skills in Spanish and English. We are a remote team meant to become a global company and that demands being great at communicating ideas or write documentation, posts, papers, etc\u003c/li\u003e\u003c/ol\u003e\u003cp\u003e\u003cstrong\u003ePlease don't bother to apply if you can't prove your expertise by showing code, this is an expert position and your Github is your resumé.\u003c/strong\u003e\u003c/p\u003e","functions":"\u003cp\u003eOur product was born to a technology company, so we serve code for breakfast everyday and it is very important it tastes and looks good. You will be key on helping us cooking our code recipes, which means you will:\u003c/p\u003e\u003col\u003e\u003cli\u003e Work side by side with the \u003cem\u003eUX\u003c/em\u003e and \u003cem\u003eUI\u003c/em\u003e teams\u003c/li\u003e\u003cli\u003e Face challenging problems that need high levels of abstraction in order to design simple solutions\u003c/li\u003e\u003cli\u003e Build epic features that go through the whole stack meaning code in \u003cem\u003eRuby on Rails\u003c/em\u003e, \u003cem\u003eReact\u003c/em\u003e, \u003cem\u003eSQL\u003c/em\u003e, background jobs and/or integrate with \u003cem\u003eAPIs\u003c/em\u003e\u003c/li\u003e\u003cli\u003e Optimize our codebase at the server and at the browser constantly looking for way to improve them, you know what they say: Leave the code better than you found it\u003c/li\u003e\u003cli\u003e Code a lot of tests in all their flavors, unit, feature, integration, end-to-end, you mention it\u003c/li\u003e\u003cli\u003e Write documentation. We think knowledge is useless unless other people have access to it, and we are kind of obsessive with \u003ca href=\"https://medium.com/getonbrd/la-cultura-de-documentar-por-defecto-bba2d3d5146c\"\u003edocumenting everything we know or learn\u003c/a\u003e\u003c/li\u003e\u003cli\u003e Mentor and pair with entry/mid-level engineers to help develop their skills\u003c/li\u003e\u003cli\u003e Review a lot of code. Expect some days with up to five or six pull requests\u003c/li\u003e\u003cli\u003e Talk to and support our customers all the time via chat, mail or phone. We don't code in the dark and we only code what creates value for our clients, so how do we know what to code? Exactly — constantly talking to them\u003c/li\u003e\u003c/ol\u003e","benefits":"\u003cp\u003eAlong with the perks is our culture. We are an \u003ca href=\"https://medium.com/mejorindustriati/la-historia-resumida-de-get-on-board-c98e4ec36009\"\u003eunconventional\u003c/a\u003e, \u003ca href=\"https://speakerdeck.com/shesho/emprendiendo-al-reves-el-caso-get-on-board\"\u003econtrarian\u003c/a\u003e company, and you’ll definitely enjoy working with a small team of smart people in a no-bullshit, respectful, honest, and extremely agile environment. In addition to that:\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003eFlexible work\u003c/strong\u003e: as long as you deliver, you will enjoy a fully flexible schedule. This job is compatible with family, kids, sports, music bands and hobbies\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eTruly remote work\u003c/strong\u003e. As long as you maintain at least 5 hours of overlap with EST timezone and have fast Internet, you can be wherever you want\u003c/li\u003e\u003cli\u003eA compensation that grows alongside our success and your performance\u003c/li\u003e\u003cli\u003eIf based in Santiago or Lima, you can co-work with us!\u003c/li\u003e\u003c/ul\u003e","remote":true,"city":null,"country":null,"country_flag_url":null,"new":false,"seniority":"Expert","logo_url":"https://getonbrd-prod.s3.amazonaws.com/uploads/users/logo/1/ISO_NEGATIVE-padding-getonboard.png","url":"/empleos/programacion/rails-and-react-full-stack-developer-get-on-board-remoto","modality":"Full time","published_at":"nov 12","company":{"name":"Get on Board","about":"This is us! We are set to shape and transform the digital job market in Latin America, giving startups and tech innovators the spotlight they deserve and helping talented digital professionals find better, more fulfilling workplaces.","url":"/companies/get-on-board"}},{"id":"ruby-semi-senior-senior-leniolabs_-remoto","title":"Ruby (Semi Senior/ Senior)","recommended":false,"pinned":false,"is_hot":false,"salary":"2400 - 2700","description":"\u003cp\u003eEstamos buscando varias personas para unirse al equipo Semi-Senior. \u003c/p\u003e\u003cul\u003e\u003cli\u003eTrabajo en equipo. \u003c/li\u003e\u003cli\u003eExcelente interacción con los miembros del equipo y la capacidad de ser un líder\u003c/li\u003e\u003cli\u003eExperiencia demostrable en Ruby.\u003c/li\u003e\u003cli\u003e Inglés: nivel intermedio mínimo.\u003c/li\u003e\u003cli\u003eProactividad.\u003c/li\u003e\u003cli\u003eGanas de aprender cosas nuevas y ser parte de un equipo multidisciplinario\u003c/li\u003e\u003cli\u003eSi tienes buena base en java puedes aplicar.\u003c/li\u003e\u003c/ul\u003e","functions":"\u003cp\u003eImportante comentar:\u003c/p\u003e\u003cul\u003e\u003cli\u003eSe trabajará en el departamento de desarrollo de tecnología de la empresa junto con el resto del equipo.\u003c/li\u003e\u003cli\u003eLos equipos están conformados por un sin número de diferentes integrantes, desde equipos de tres personas, hasta equipos de seis. Dependiendo de las necesidades del proyecto y lo grande del reto.\u003c/li\u003e\u003cli\u003eContamos internamente con personas capacitadas para realizar QA, Líder de proyecto, etc.\u003c/li\u003e\u003cli\u003eSerá responsable de avanzar en los diferentes requerimientos del cliente, junto con el equipo.\u003c/li\u003e\u003cli\u003eSe tienen reuniones semanales con el cliente y el equipo en las cuales se tiene que participar de forma activa.\u003c/li\u003e\u003cli\u003eUtilizamos metodologías SCRUM y XP para nuestros proyectos.\u003c/li\u003e\u003c/ul\u003e","benefits":"\u003cul\u003e\u003cli\u003eEl cargo es con relación de dependencia tanto en Chile como Argentina.\u003c/li\u003e\u003cli\u003eOSDE (OSDE sólo para Argentina). Seguro de ley para Chile. más Metlife\u003c/li\u003e\u003cli\u003ePosibilidad de ganar 2 bonos al año\u003c/li\u003e\u003cli\u003e2 ajustes salariales al año\u003c/li\u003e\u003cli\u003eClases de inglés\u003c/li\u003e\u003cli\u003eMaterial de trabajo (PC)\u003c/li\u003e\u003cli\u003ePropuesta de feriados\u003c/li\u003e\u003cli\u003eCursos\u003c/li\u003e\u003cli\u003eCompra de libros\u003c/li\u003e\u003cli\u003eApoyo en la compra de materiales de trabajo\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eNota: el salario sale reflejado en dólares americanos pero nuestra remuneración es en la moneda que corresponda a cada país, ya que por términos legales no podemos cancelar en esa moneda. Para argentina el salario está dolarizado.\u003c/p\u003e","remote":true,"city":null,"country":null,"country_flag_url":null,"new":true,"seniority":"Semi Senior","logo_url":"https://getonbrd-prod.s3.amazonaws.com/uploads/users/logo/4161/l-icon2.png","url":"/empleos/programacion/ruby-semi-senior-senior-leniolabs_-remoto","modality":"Full time","published_at":"dic 04","company":{"name":"Leniolabs_","about":"Empresa dedicada al desarrollo de Aplicaciones Web y Big Data","url":"/companies/coddde"}},{"id":"desarrollador-full-stack-para-nivelat-continuum-santiago","title":"Desarrollador Full-Stack para Nivelat","recommended":false,"pinned":false,"is_hot":false,"salary":"2600 - 3400","description":"\u003cdiv\u003e\u003cstrong\u003eNuestro stack es Amazon Web Services, PostgreSQL, Ruby on Rails, React y React Native\u003c/strong\u003e por lo que la experiencia demostrable en ellos es clave. Pero más que conocer estas tecnologías, buscamos un(a) profesional políglota, capaz de plantear soluciones desde la arquitectura hasta la implementación. Esperamos que hayas construido software en equipo, ya sea productos o servicios (SaaS). Además que seas capaz de liderar un grupo, ayudarlos y apoyarlos con tus conocimientos y que tengas por supuesto espíritu emprendedor.\u003c/div\u003e","functions":"\u003cdiv\u003eSi te unes al equipo, esperamos que puedas:\u003c/div\u003e\u003cul\u003e\u003cli\u003eDiseñar soluciones en forma eficiente y rápida a problemas/desafíos del producto/negocio, \u003cstrong\u003esiempre pensando en el usuario final.\u003c/strong\u003e\u003c/li\u003e\u003cli\u003eSer autónomo (no queremos que simplemente llegues a recibir órdenes) y tener opinión, alineándote a conseguir los objetivos que nos proponemos (que co-definimos cada año como equipo en un retiro de empresa). \u003c/li\u003e\u003cli\u003eRealizar cambios y ajustes en todos nuestras aplicaciones tanto de cara a clientes como internos, sean web o mobile.\u003c/li\u003e\u003cli\u003eSe capaz de guiar a un equipo y que cuando miembros junior entren a tu equipo los ayudes a crecer y aprender.\u003c/li\u003e\u003c/ul\u003e","benefits":"","remote":false,"city":"Santiago","country":"Chile","country_flag_url":"https://d2dgum4gsvdsrq.cloudfront.net/assets/flags/cl_mini-43732ca1dce0306aebced22a6205cb8bab0d2747005d1154a045776ba5aea7a9.png","new":false,"seniority":"Semi Senior","logo_url":"https://getonbrd-prod.s3.amazonaws.com/uploads/users/logo/1532/new-medusa-logo-continuum-fondo.png","url":"/empleos/programacion/desarrollador-full-stack-para-nivelat-continuum-santiago","modality":"Full time","published_at":"nov 28","company":{"name":"Continuum","about":"Somos un equipo de rebeldes, con mentalidad de experimentación y hambre de romper paradigmas. Ayudamos a empresas líderes a sacudir el status quo y a tomarse en serio la innovación, la tecnología y la agilidad. ","url":"/companies/continuum"}},{"id":"ingeniero-en-desarrollo-react-tcit-santiago","title":"Ingeniero en Desarrollo React","recommended":false,"pinned":false,"is_hot":true,"salary":"1000 - 2600","description":"\u003cp\u003eTrabajamos presencialmente para facilitar la comunicación con el resto del equipo. Nos gusta partir temprano nuestra jornada para aprovechar la tarde en nuestras actividades personales. Además, nos preocupamos de que nuestra ambiente de trabajo sea sereno para concentrarnos mejor.\u003c/p\u003e\u003cp\u003eDebes tener algún título de Ingeniero en Computación, T.I., Informática o similar.\u003c/p\u003e\u003cp\u003eNo es necesario ser experto pero sí tener conocimientos de frameworks web. Necesitas estar familiarizado con al menos un ambiente de desarrollo backend como Express.js o Ruby on Rails y tener conocimiento en tecnologías de desarrollo frontend como React, Angular, Vue o similar. \u003c/p\u003e","functions":"\u003cp\u003eBuscamos un compañero que nos ayude en desarrollo fullstack para nuestras diferentes aplicaciones. Siempre hay espacio en el quipo para que puedas ir desenvolviéndote desde el área que más te sientas cómodo, ya sea en el front, back o alguna tecnología en particular.\u003c/p\u003e\u003cp\u003eEl ambiente de trabajo es tranquilo pero intenso, buscamos desarrolladores entusiastas, con ganas de aprender, proactivos, con alma de emprendedores y creativos.\u003c/p\u003e\u003cp\u003eSe trabajará en un equipo altamente calificado en el cual podrán desenvolverse de buena forma y aprender de nuestros conocimientos.\u003c/p\u003e\u003cp\u003ePreferimos afinar los detalles al momento del contacto por lo que si estás interesado postula para poder conocerte mejor.\u003c/p\u003e","benefits":"\u003cp\u003eNo nos importa cómo te guste estar vestido. Preferimos que vengas de la manera que te sientas más cómodo.\u003c/p\u003e\u003cp\u003eNuestro horario promedio hace que puedas salir a las 12:30 los días viernes.\u003c/p\u003e\u003cp\u003eNuestras oficinas quedan a pasos del metro y nos gusta hacer deporte, por lo que tenemos convenio con UrbanFit por si te interesa tener tu cuerpo sano.\u003c/p\u003e\u003cp\u003eAlmuerzo en una cafetería cercana y Spotify Premium son también beneficios para todos en el equipo.\u003c/p\u003e\u003cp\u003eTambién existen oportunidades de co-financiamiento de estudios.\u003c/p\u003e\u003cp\u003e¡Te esperamos!\u003c/p\u003e","remote":false,"city":"Santiago","country":"Chile","country_flag_url":"https://d2dgum4gsvdsrq.cloudfront.net/assets/flags/cl_mini-43732ca1dce0306aebced22a6205cb8bab0d2747005d1154a045776ba5aea7a9.png","new":false,"seniority":"Sin experiencia","logo_url":"https://getonbrd-prod.s3.amazonaws.com/uploads/users/logo/2314/Isotipo_200x200.png","url":"/empleos/programacion/ingeniero-en-desarrollo-react-tcit-santiago","modality":"Full time","published_at":"oct 29","company":{"name":"TCIT","about":"Líderes en desarrollo de software en modalidad cloud","url":"/companies/tcit"}},{"id":"desarrollador-frontend-keyclouding-santiago","title":"Desarrollador Front-end","recommended":false,"pinned":false,"is_hot":false,"salary":"1000 - 1900","description":"\u003cdiv\u003eDebes tener experiencia comprobable en React, Redux, además, en el uso y consumo de APIs y tests.\u003c/div\u003e\u003cdiv\u003eUso intermedio o avanzado de Git\u003c/div\u003e\u003cdiv\u003eEn keyclouding valoramos a las personas proactivas y comprometidas. Debes ser capaz de organizar tus tareas y cumplir con tus plazos sin necesidad de presión.\u003c/div\u003e","functions":"\u003cdiv\u003eMantener, diseñar y desarrollar funcionalidades para la plataforma.\u003cbr\u003eInvolucrarse en la planificación estratégica, sprints, dailys, y release planning, entre otros.\u003cbr\u003eApoyar en la refactorización de los módulos existentes en la plataforma, según las necesidades del negocio.\u003cbr\u003eGenerar documentación necesaria siguiendo los más altos estándares de la comunidad.\u003cbr\u003eApoyar a la resolución de incidencias y contingencias relacionadas con las aplicaciones mantenidas por el equipo.\u003c/div\u003e","benefits":"","remote":false,"city":"Santiago","country":"Chile","country_flag_url":"https://d2dgum4gsvdsrq.cloudfront.net/assets/flags/cl_mini-43732ca1dce0306aebced22a6205cb8bab0d2747005d1154a045776ba5aea7a9.png","new":false,"seniority":"Junior","logo_url":"https://getonbrd-prod.s3.amazonaws.com/uploads/users/logo/6531/19702537_1567218219996742_6401247274527773892_n.jpg","url":"/empleos/programacion/desarrollador-frontend-keyclouding-santiago","modality":"Full time","published_at":"oct 29","company":{"name":"KeyClouding","about":"KeyClouding es una moderna plataforma de selección online con pruebas psicolaborales digitales.","url":"/companies/keyclouding"}},{"id":"fullstack-ruby-on-rails-migrante-sociedad-financiera-santiago","title":"Full-Stack Ruby on Rails","recommended":false,"pinned":false,"is_hot":false,"salary":"2200 - 4000","description":"\u003cp\u003ePasión por desarrollar\u003c/p\u003e\u003cp\u003eExperiencia desarrollando como fullstack Ruby on Rails (excluyente)\u003c/p\u003e\u003cp\u003eAl menos 2 años de experiencia en RoR (al menos 1 año fuera de la universidad/instituto/academia)\u003c/p\u003e\u003cp\u003eJavascript/jQuery/AJAX (básico)\u003c/p\u003e\u003cp\u003eBase de datos Postgres\u003c/p\u003e\u003cp\u003eManejo de Git (GitHub)\u003c/p\u003e\u003cp\u003eConocimientos de Bootstrap y/o Material design\u003c/p\u003e\u003cp\u003eProactivo/a\u003c/p\u003e","functions":"\u003cp\u003eSi sueñas con Ruby on Rails y te encanta programar, ¡eres la persona para este puesto! Tendrás libertad para desarrollar tanto requerimientos de la empresa como ideas propias que aporten a la misión y visión de la empresa.\u003c/p\u003e\u003cp\u003eEl cargo consta en desempeñarse en los diferentes ámbitos de desarrollo de la plataforma web y back office creando soluciones que automaticen y mejoren procesos para las diferentes áreas. Tendrás que desarrollar software para mitigar procesos de cobranza y riesgo, mejorar agilidad y tiempos de respuesta de finanzas, proyectos de información para el cliente interno y externo, entre otros.\u003c/p\u003e\u003cp\u003eTe sumarás a un equipo en pleno crecimiento por lo que tendrás que atender necesidades de las diferentes áreas. Queremos a alguien que pueda ser autónomo y que pueda tomar decisiones para lograr los objetivos de la empresa.\u003c/p\u003e","benefits":"","remote":false,"city":"Santiago","country":"Chile","country_flag_url":"https://d2dgum4gsvdsrq.cloudfront.net/assets/flags/cl_mini-43732ca1dce0306aebced22a6205cb8bab0d2747005d1154a045776ba5aea7a9.png","new":false,"seniority":"Semi Senior","logo_url":"https://getonbrd-prod.s3.amazonaws.com/uploads/users/logo/7933/migrante_cuadrado_Mesa_de_trabajo_1.jpg","url":"/empleos/programacion/fullstack-ruby-on-rails-migrante-sociedad-financiera-santiago","modality":"Full time","published_at":"oct 21","company":{"name":"Migrante Sociedad Financiera","about":"Somos un equipo en pleno crecimiento que busca mejorar la experiencia de extranjeros a través de acceso financiero.  ","url":"/companies/migrante-sociedad-financiera"}},{"id":"desarrollador-fullstack-ror-react-webdox-santiago","title":"Desarrollador (Rails y React)","recommended":false,"pinned":false,"is_hot":false,"salary":"1400 - 3000","description":"\u003cul\u003e\u003cli\u003eExperiencia en Ruby on Rails.\u003c/li\u003e\u003cli\u003eFamiliarizado con librerías y frameworks de desarrollo frontend (React).\u003c/li\u003e\u003cli\u003eDebes tener experiencia haciendo tests.\u003c/li\u003e\u003cli\u003eExperiencia en CSS.\u003c/li\u003e\u003cli\u003eHas trabajado manejando datos vía interfaces REST.\u003c/li\u003e\u003cli\u003eLas buenas prácticas por encima de todo.\u003c/li\u003e\u003cli\u003eExperiencia con herramientas de control de versiones.\u003c/li\u003e\u003cli\u003eDebes tener por lo menos un año de experiencia.\u003c/li\u003e\u003cli\u003eDebes mantener un nivel básico de inglés.\u003c/li\u003e\u003c/ul\u003e","functions":"\u003cp\u003e\u003cstrong\u003eEstamos buscando desarrolladores Junior y Semi-Senior para el área de tecnología.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eTus principales funciones serán:\u003c/p\u003e\u003cul\u003e\u003cli\u003eMantener, diseñar y desarrollar funcionalidades para la plataforma.\u003c/li\u003e\u003cli\u003eInvolucrarse en la planificación estratégica, sprints, dailys, y release planning, entre otros.\u003c/li\u003e\u003cli\u003eApoyar en la refactorización de los módulos existentes en la plataforma, según las necesidades del negocio.\u003c/li\u003e\u003cli\u003eGenerar documentación necesaria siguiendo los más altos estándares de la comunidad.\u003c/li\u003e\u003cli\u003eApoyar a la resolución de incidencias y contingencias relacionadas con las aplicaciones mantenidas por el equipo de ingenieria.\u003c/li\u003e\u003c/ul\u003e","benefits":"","remote":false,"city":"Santiago","country":"Chile","country_flag_url":"https://d2dgum4gsvdsrq.cloudfront.net/assets/flags/cl_mini-43732ca1dce0306aebced22a6205cb8bab0d2747005d1154a045776ba5aea7a9.png","new":false,"seniority":"Junior","logo_url":"https://getonbrd-prod.s3.amazonaws.com/uploads/users/logo/2626/inverted.png","url":"/empleos/programacion/desarrollador-fullstack-ror-react-webdox-santiago","modality":"Full time","published_at":"oct 16","company":{"name":"Webdox","about":"Webdox es una plataforma de gestión contractual utilizada por las principales empresas de Latinoamérica.","url":"/companies/webdox-0b8326e1-eabb-48aa-8577-435b15911508"}},{"id":"desarrollador-web-centro-medico-del-trabajador-santiago","title":"Desarrollador Web","recommended":false,"pinned":false,"is_hot":true,"salary":"1300 - 1400","description":"\u003cdiv\u003eEstamos en busca de un desarrollador con al menos 1 año de experiencia utilizando las siguientes tecnologías:\u003c/div\u003e\u003cul\u003e\u003cli\u003eJavascript / Typescript\u003c/li\u003e\u003cli\u003eAngular 2.+ o algún framework de JS como ReactJS o VueJS\u003c/li\u003e\u003cli\u003eCSS/SASS\u003c/li\u003e\u003cli\u003eAPI REST \u003c/li\u003e\u003c/ul\u003e","functions":"\u003cdiv\u003e\u003cstrong\u003eBuscamos una persona comprometida, con iniciativa y autodidacta. Sus principales funciones serán desarrollar mejoras en el software del centro médico y además trabajar en las nuevas funcionalidades desde el frontend de nuestra aplicación web para clientes.\u003c/strong\u003e\u003c/div\u003e","benefits":"","remote":false,"city":"Santiago","country":"Chile","country_flag_url":"https://d2dgum4gsvdsrq.cloudfront.net/assets/flags/cl_mini-43732ca1dce0306aebced22a6205cb8bab0d2747005d1154a045776ba5aea7a9.png","new":false,"seniority":"Junior","logo_url":"https://getonbrd-prod.s3.amazonaws.com/uploads/users/logo/2789/icono_slack.jpg","url":"/empleos/programacion/desarrollador-web-centro-medico-del-trabajador-santiago","modality":"Full time","published_at":"oct 15","company":{"name":"Centro Medico del Trabajador","about":"Somos un centro de salud dedicado a la realización de exámenes preocupacionales y medicina preventiva, con altos estándares de calidad y profesionales capacitados que permiten asegurar que sus trabajadores se encuentren en óptimas condiciones físicas.","url":"/companies/centro-medico-del-trabajador"}},{"id":"cto-desarrollador-mobile-ios-android-kind-screen-santiago","title":"Desarrollador Mobile iOS / Android","recommended":false,"pinned":false,"is_hot":true,"salary":"","description":"\u003cul\u003e\u003cli\u003eDesarrollo de aplicaciones móviles de al menos 2 años (Swift / Kotlin / Java) \u003c/li\u003e\u003cli\u003eAl menos 2 años de experiencia en desarrollo de software: Java / Python / Rails / Groovy / Ruby / JavaScript / Swift / Objective C / Nodejs\u003c/li\u003e\u003cli\u003eCómodo trabajando con datos en SQL, JSON, CSV, YAML, XML, etc.\u003c/li\u003e\u003c/ul\u003e","functions":"\u003cdiv\u003eKind Screen es una startup, así que serías una \u003cstrong\u003eparte clave del equipo\u003c/strong\u003e! Tenemos expertos en negocios, educación, diseño UX/UI y mentores con experiencias diversas. Tenemos ya un desarrollador (CTO) y ahora estamos buscando Desarrollador iOS/Android adicional. \u003c/div\u003e\u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eTus Responsabilidades\u003c/em\u003e\u003c/strong\u003e\u003c/div\u003e\u003col\u003e\u003cli\u003eFamiliarizarte con el código de la primera versión del app e incorporar el nuevo diseño de nuestro app para crear las nuevas versiones en iOS y Android (nuestro desarrollador anterior trabajará contigo en el traspaso).\u003c/li\u003e\u003cli\u003eDe igual manera, tomar el código que existe del backend que maneja los contenidos del app (ejercicios educativos que van dentro del app) e incorporar las nuevas mejoras de diseño (nuestro desarrollador anterior trabajará contigo en el traspaso).\u003c/li\u003e\u003cli\u003eEscribir el código para la publicación de nuestro nuevo sitio web (también puedes tomar el código del landing page que ya tenemos como punto de partida).\u003c/li\u003e\u003c/ol\u003e\u003cdiv\u003e\u003cstrong\u003e\u003cem\u003eEstado Actual de nuestros desarrollos\u003c/em\u003e\u003c/strong\u003e\u003c/div\u003e\u003cul\u003e\u003cli\u003eSe ha escrito una versión iOS del app utilizando Swift.\u003c/li\u003e\u003cli\u003eTambién la versión Android del app utilizando Kotlin.\u003c/li\u003e\u003cli\u003eExiste desarrollado el backend para dos tipos de usuarios (1) el Administrador que aprueba y revisa contenidos del app, y crea otros usuarios que pueden subir contenidos, (2) los educadores que suben contenidos (ejercicios) al app. \u003c/li\u003e\u003cli\u003eEl backend fue creado en Javascript utilizando NodeJs y Angular.\u003c/li\u003e\u003cli\u003eSe publicó un landing page del sitio web, código Javascript React.\u003c/li\u003e\u003c/ul\u003e","benefits":"","remote":true,"city":"Santiago","country":"Chile","country_flag_url":"https://d2dgum4gsvdsrq.cloudfront.net/assets/flags/cl_mini-43732ca1dce0306aebced22a6205cb8bab0d2747005d1154a045776ba5aea7a9.png","new":false,"seniority":"Semi Senior","logo_url":"https://getonbrd-prod.s3.amazonaws.com/uploads/users/logo/7632/logo-ks-01.png","url":"/empleos/desarrollo-mobile/cto-desarrollador-mobile-ios-android-kind-screen-santiago","modality":"Freelance","published_at":"oct 10","company":{"name":"Kind Screen","about":"Startup basada en Chile y Boston (USA) ganadora del \"Education Entrepreneurship Fellowship\" de la facultad de Educación de Harvard. Somos una aplicación móvil que ayuda a los adultos a enseñar a los niños habilidades socio-emocionales para la vida.","url":"/companies/kind-screen"}},{"id":"dev-ror-vflight-santiago","title":"Dev Ruby on Rails (RoR)","recommended":false,"pinned":false,"is_hot":false,"salary":"1800 - 3000","description":"\u003cul\u003e\u003cli\u003eManejo avanzado de Ruby on Rails: Debes tener experiencia y conocimiento demostrable en proyectos con RoR. Tanto para trabajar sobre desarrollos existentes como en nuevos proyectos.\u003c/li\u003e\u003cli\u003eJavaScript ES6\u003c/li\u003e\u003cli\u003eHtml/CSS3\u003c/li\u003e\u003cli\u003eGit\u003c/li\u003e\u003c/ul\u003e","functions":"\u003cdiv\u003eComo Desarrollador Full Stack Ruby on Rails esperamos lo siguiente de ti:\u003c/div\u003e\u003cul\u003e\u003cli\u003eParticipar activamente en la creación de nuevos productos, tanto en su lógica funcional como en su programación. Esperamos que ocupes tus conocimientos en computación en todas las etapas del desarrollo de un software.\u003c/li\u003e\u003cli\u003eIdear e implementar mejoras en los productos ya desarrollados. Nuestro enfoque de trabajo se basa fuertemente en la creación de nuevas funcionalidades a partir del diálogo constante con nuestros clientes.\u003c/li\u003e\u003cli\u003eAyudar en la coordinación del equipo de programación. Trabajamos con metodologías ágiles y con una política de conocimiento 100% abierto, por lo que el espíritu de equipo es una cualidad intransable para nosotros.\u003c/li\u003e\u003c/ul\u003e","benefits":"\u003cul\u003e\u003cli\u003eEl \u003cstrong\u003e10% de tu jornada\u003c/strong\u003e puede ser destinada para perfeccionarte y probar \u003cstrong\u003elo que tú quieras\u003c/strong\u003e (aprender algún lenguaje de programación, desarrollar MVP’s de apps, etc.). \u003c/li\u003e\u003cli\u003eHorario flexible: Lunes a Viernes. Entrada entre 8:30 - 10:00 y salida entre 17:30 y 19:00, esta última se condice con la entrada. Trabajamos 40 horas semanales.\u003c/li\u003e\u003cli\u003eBono deporte: Ayudamos a financiar la práctica del deporte que más te gusta.\u003c/li\u003e\u003cli\u003eNuestra filosofía es poder venir felices a trabajar, generar un ambiente de confianza, sin dejar de cumplir nuestros objetivos.\u003c/li\u003e\u003cli\u003ePosibilidad de unirse a un startup de alto potencial de crecimiento.\u003c/li\u003e\u003c/ul\u003e","remote":false,"city":"Santiago","country":"Chile","country_flag_url":"https://d2dgum4gsvdsrq.cloudfront.net/assets/flags/cl_mini-43732ca1dce0306aebced22a6205cb8bab0d2747005d1154a045776ba5aea7a9.png","new":false,"seniority":"Semi Senior","logo_url":"https://getonbrd-prod.s3.amazonaws.com/uploads/users/logo/6222/isotipo_naranjo.png","url":"/empleos/programacion/dev-ror-vflight-santiago","modality":"Full time","published_at":"sep 30","company":{"name":"vFlight","about":"vFlight es un startup de transformación digital.","url":"/companies/vflight"}},{"id":"desarrollador-ruby-on-rails-keyclouding-santiago","title":"Desarrollador Ruby on Rails","recommended":false,"pinned":false,"is_hot":false,"salary":"1200 - 1600","description":"\u003cp\u003eDebes tener experiencia demostrable en Ruby On Rails.\u003cbr\u003e Además, conocimientos de React, Git, HTML, Css, Javascript, Jquery, postgres. (Deseable)\u003c/p\u003e\u003cp\u003eEn keyclouding valoramos a las personas proactivas y comprometidas. Debes ser capaz de organizar tus tareas y cumplir con tus plazos sin necesidad de presión. \u003c/p\u003e","functions":"\u003cp\u003eTrabajaras en el área de desarrollo, junto a un equipo multidisciplinario de desarrolladores y diseñadores. \u003cbr\u003eEstarás colaborando principalmente en el desarrollo de nuevas características de nuestra plataforma en Ruby on Rails , además de modelar soluciones eficientes a las problemáticas de la plataforma.\u003c/p\u003e","benefits":"","remote":false,"city":"Santiago","country":"Chile","country_flag_url":"https://d2dgum4gsvdsrq.cloudfront.net/assets/flags/cl_mini-43732ca1dce0306aebced22a6205cb8bab0d2747005d1154a045776ba5aea7a9.png","new":false,"seniority":"Junior","logo_url":"https://getonbrd-prod.s3.amazonaws.com/uploads/users/logo/6531/19702537_1567218219996742_6401247274527773892_n.jpg","url":"/empleos/programacion/desarrollador-ruby-on-rails-keyclouding-santiago","modality":"Full time","published_at":"sep 24","company":{"name":"KeyClouding","about":"KeyClouding es una moderna plataforma de selección online con pruebas psicolaborales digitales.","url":"/companies/keyclouding"}},{"id":"desarrollador-ruby-on-rails-nnodes-santiago-1c06","title":"Desarrollador Ruby on Rails","recommended":false,"pinned":false,"is_hot":true,"salary":"1200 - 2000","description":"\u003cp\u003eBuscamos personas inquietas por aprender y mejorar constantemente, proactivas en buscar soluciones inteligentes y que no tenga miedo de asumir grandes e interesantes desafíos. Nos gusta trabajar rigurosamente, bajo un ambiente muy \u003cstrong\u003eamistoso e informal\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eTrabajamos con múltiples clientes de diferentes rubros, por lo que el puesto ofrece la posibilidad de trabajar en el desarrollo de plataformas web a medida para restaurantes, imprentas, malls, inmobiliarias, clínicas, etc.\u003c/p\u003e\u003cp\u003eSerás parte de distintos equipos, cada uno con diferentes talentos, y trabajarás junto a otras personas que posiblemente vayan cambiando de proyectos a medida que sus habilidades sean requeridas.\u003cbr\u003e\u003cstrong\u003e\u003cbr\u003eRequerimientos técnicos:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eDebes manejar Ruby On Rails o demostrar conocimientos en Django y/o Node.js (este punto es un requisito excluyente).\u003c/li\u003e\u003cli\u003eAdemás, poseer conocimientos en HTML, CSS y JavaScript.\u003c/li\u003e\u003cli\u003eDebes contar con experiencia en estructuras de datos, lógica operacional.\u003c/li\u003e\u003cli\u003eGit.\u003c/li\u003e\u003cli\u003eExperiencia demostrable en aplicaciones web.\u003c/li\u003e\u003c/ul\u003e","functions":null,"benefits":"\u003cp\u003eLo que más nos importa es tener un ambiente laboral envidiable, y nos lo tomamos muy en serio. A disposición tuya habrán televisores de 50\" para ver partidos y jugar Nintendo Switch (siempre jugamos después de almuerzo), tendrás dulces, galletas y café entre otras cosas. También realizamos eventos a lo largo del año, algunos de ellos son los \u003cstrong\u003e“N Games”\u003c/strong\u003e, parecido a una olimpiada de verano por equipos; y los \u003cstrong\u003e“Winter N Games”\u003c/strong\u003e, que se enfocan más en actividades indoor. Más allá de los beneficios, realmente nos encanta ver a nuestro equipo feliz y motivado, siempre estaremos dispuestos a conversar y mejorar nuestro ambiente de trabajo.\u003c/p\u003e\u003cp\u003eRealizamos \u003cstrong\u003e“Show N Tell”\u003c/strong\u003e, son charlas internas que exponen nuevos conceptos, tecnologías o experiencias de cada uno de los miembros del equipo. La temática y el estilo de la presentación quedan a disposición del expositor, lo que permite que esta instancia sea divertida y dinámica. Quién sabe, puede que tú te lleves el galvano a mejor Show N Tell del año.\u003c/p\u003e","remote":false,"city":"Santiago","country":"Chile","country_flag_url":"https://d2dgum4gsvdsrq.cloudfront.net/assets/flags/cl_mini-43732ca1dce0306aebced22a6205cb8bab0d2747005d1154a045776ba5aea7a9.png","new":false,"seniority":"Junior","logo_url":"https://getonbrd-prod.s3.amazonaws.com/uploads/users/logo/2647/Logo_Nnodes_cuadrado.jpg","url":"/empleos/programacion/desarrollador-ruby-on-rails-nnodes-santiago-1c06","modality":"Full time","published_at":"jul 25","company":{"name":"Nnodes","about":"Nnodes (www.nnodes.com) es una empresa de desarrollo de software innovadora y en crecimiento que vende tecnología de excelencia, donde el compromiso es entregar un servicio de calidad, estando siempre a disposición del cliente.","url":"/companies/nnodes-4e4c91c7-4728-4e25-9c36-f466f0ecf456"}},{"id":"full-stack-developer-bridge-us","title":"Full-Stack Developer","recommended":false,"pinned":false,"is_hot":true,"salary":"2600 - 5000","description":"\u003cdiv\u003eWhat will you do at Bridge?\u003c/div\u003e\u003cul\u003e\u003cli\u003eWrite clean, tested Ruby and React code\u003c/li\u003e\u003cli\u003eCollaboratively architect, build, and deploy new services and features that serve our community of business clients, attorneys, and foreign nationals\u003c/li\u003e\u003cli\u003eParticipate in application maintenance and on-call rotations\u003c/li\u003e\u003cli\u003eHave opportunities to learn and use the latest technology to pursue our objectives\u003c/li\u003e\u003c/ul\u003e\u003cdiv\u003e3+ years of experience shipping quality consumer or enterprise web products using:\u003c/div\u003e\u003cul\u003e\u003cli\u003eRuby/Rails\u003c/li\u003e\u003cli\u003eReact\u003c/li\u003e\u003cli\u003ePostgreSQL\u003c/li\u003e\u003c/ul\u003e\u003cdiv\u003eFull-stack experience, including:\u003c/div\u003e\u003cul\u003e\u003cli\u003eDeploying, managing, and maintaining multiple Heroku/AWS environments\u003c/li\u003e\u003cli\u003ePerformance tuning and refactoring applications\u003c/li\u003e\u003cli\u003eOn-call experience debugging front end and back end issues\u003c/li\u003e\u003cli\u003eAgile, git based workflows\u003c/li\u003e\u003c/ul\u003e\u003cdiv\u003eWe work core hours: 9am - 1pm PT M-F. Other hours can be flexed. \u003c/div\u003e\u003cdiv\u003e\u003cstrong\u003ePlease submit your application in English.\u003c/strong\u003e\u003c/div\u003e","functions":"","benefits":"\u003cdiv\u003eWe truly love what we do. Working at Bridge US is a chance to be a part of the next generation of legal services. We are the fastest growing immigration services provider in the US and we are just getting started! We value our employees tremendously. We provide:\u003c/div\u003e\u003cul\u003e\u003cli\u003eUS visa sponsorship after 6 months of employment (or for the H-1B Cap)\u003c/li\u003e\u003cli\u003eFlexible hours (outside of core hours 9am-12pm PT)\u003c/li\u003e\u003cli\u003eUnlimited vacation\u003c/li\u003e\u003c/ul\u003e","remote":true,"city":null,"country":null,"country_flag_url":null,"new":false,"seniority":"Senior","logo_url":"https://getonbrd-prod.s3.amazonaws.com/uploads/users/logo/6287/Bridge_250x250.png","url":"/empleos/programacion/full-stack-developer-bridge-us","modality":"Full time","published_at":"jul 25","company":{"name":"Bridge","about":"The fastest growing immigration provider in the U.S.","url":"/companies/bridge-us"}},{"id":"desarrollador-front-end-reactjs-webdox-santiago","title":"Desarrollador Front-end ReactJS","recommended":false,"pinned":false,"is_hot":true,"salary":"1800 - 3000","description":"\u003cp\u003e\u003cstrong\u003eEstamos buscando una persona para el área de Frontend como miembro del equipo de ingeniería de software. El objetivo es ayudarnos a hacer nuestra aplicación de primer mundo!\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eTus principales funciones serán:\u003c/p\u003e\u003cul\u003e\u003cli\u003eDiseñar y desarrollar componentes para la aplicación Front de la plataforma.\u003c/li\u003e\u003cli\u003eInvolucrarse en la planificación estratégica, sprints, dailys, y release planning de la capa de Frontend, entre otros.\u003c/li\u003e\u003cli\u003eApoyar en la refactorización de los módulos existentes en la plataforma, según las necesidades del negocio.\u003c/li\u003e\u003cli\u003eGenerar documentación necesaria siguiendo los más altos estándares de la comunidad.\u003c/li\u003e\u003cli\u003eApoyar a la resolución de incidencias y contingencias relacionadas con las aplicaciones mantenidas por el equipo de desarrollo.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eDebes cumplir con los siguientes requisitos\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eExperiencia en React.js con Redux.\u003c/li\u003e\u003cli\u003eExperiencia en CSS con SASS.\u003c/li\u003e\u003cli\u003eHas trabajado manejando datos vía REST Apis.\u003c/li\u003e\u003cli\u003eDebes tener experiencia haciendo Tests de javascript.\u003c/li\u003e\u003cli\u003eLas buenas prácticas por encima de todo.\u003c/li\u003e\u003cli\u003eDebes tener por lo menos 2 años de experiencia en lo anterior descrito.\u003c/li\u003e\u003cli\u003eDebes mantener un nivel básico de inglés (para leer y escribir código).\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eDeseables\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eTypescript\u003c/li\u003e\u003cli\u003eExperiencia con frontend en proyectos Rails.\u003c/li\u003e\u003cli\u003eConocimiento en metodologías ágilies bajo framework Scrum.\u003c/li\u003e\u003cli\u003eExperiencia con GraphQL\u003c/li\u003e\u003c/ul\u003e","functions":"","benefits":"\u003cp\u003eEn Webdox nos diferenciamos por ser una empresa altamente inclusiva, buena onda y orientada al foco en el usuario. Trabajamos en una oficina de primer nivel ubicada a una cuadra del metro Pedro de Valdivia y de varias cafeterías y restaurantes.\u003c/p\u003e\u003cp\u003eSabemos que en oportunidades necesitarás quedarte en casa, por lo que tendrás la posibilidad de realizar trabajo remoto 1 vez por semana e incluso tendrás un horario flexible sin ningún inconveniente.\u003c/p\u003e\u003cp\u003eNuestra oferta de sueldos es altamente competitiva según tu experiencia, adicionalmente nuestra plan de mejora continua permite que puedas escalar.\u003c/p\u003e\u003cp\u003eOh! Y también tenemos una máquina de café automática con café de grano italiano!\u003c/p\u003e","remote":false,"city":"Santiago","country":"Chile","country_flag_url":"https://d2dgum4gsvdsrq.cloudfront.net/assets/flags/cl_mini-43732ca1dce0306aebced22a6205cb8bab0d2747005d1154a045776ba5aea7a9.png","new":false,"seniority":"Semi Senior","logo_url":"https://getonbrd-prod.s3.amazonaws.com/uploads/users/logo/2626/inverted.png","url":"/empleos/programacion/desarrollador-front-end-reactjs-webdox-santiago","modality":"Full time","published_at":"jul 02","company":{"name":"Webdox","about":"Webdox es una plataforma de gestión contractual utilizada por las principales empresas de Latinoamérica.","url":"/companies/webdox-0b8326e1-eabb-48aa-8577-435b15911508"}},{"id":"back-end-developer-ipsum-santiago","title":"Back-end Developer","recommended":false,"pinned":false,"is_hot":false,"salary":"1600 - 2400","description":"\u003cp\u003eBuscamos un desarrollador pro-activo y motivado en ingresar a nuestro equipo. Como stack tecnológico, utilizamos principalmente Ruby on Rails para el backend, el conocer React para el frontend es deseable. \u003c/p\u003e\u003cp\u003eQueremos tu apoyo en el core de la aplicación, creación de features y desarrollo de estrategias para mejorar la performance de la misma.\u003c/p\u003e\u003cp\u003eConocimientos y Requerimientos Mínimos:\u003c/p\u003e\u003cul\u003e\u003cli\u003eFull Time\u003c/li\u003e\u003cli\u003ePresencial con horario flexible\u003c/li\u003e\u003cli\u003eRuby on Rails (3 años o mas)\u003c/li\u003e\u003cli\u003eSi eres extranjero, debes tener permiso para trabajar y contar con RUT.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eHabilidades:\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003eNo rendirse a la primera, ser constante y comunicar.\u003c/strong\u003e\u003c/li\u003e\u003cli\u003eSaber pedir ayuda en caso de bloqueo y t\u003cstrong\u003eener disposición para apoyar a los que esten bloqueados.\u003c/strong\u003e\u003c/li\u003e\u003cli\u003eQue te motive ser parte de una Startup en pleno crecimiento y con mucho potencial.\u003c/li\u003e\u003cli\u003eTrabajo en Equipo, después de todo… tus compañeros son los amigos que tienes en el trabajo.\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eSer capaz de cumplir nuestro lema: \"El problema de un miembro del equipo es problema de todos”.\u003c/strong\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eDebido a nuestro crecimiento, estamos en busca de fortalecer el equipo de desarrollo, para eso necesitamos buena voluntad y disposición para trabajar. Que tengas amor por tu propio código y que quieras construir herramientas de calidad. Además, debes ser colaborativo con el resto y productivo para cumplir las metas.\u003c/p\u003e\u003cp\u003eSi tus resultados son buenos, mejor será tu valoración dentro de la empresa, creemos firmemente en la relación esfuerzo - incentivos.\u003c/p\u003e\u003cp\u003eEl contrato será a plazo fijo, y luego indefinido sujeto a evaluación.\u003c/p\u003e","functions":null,"benefits":"\u003cp\u003eSomos un equipo que nos encanta compartir conocimiento y lograr los desafíos en conjunto. Somos abiertos a las ideas que agregan valor y opciones de mejora. Si no logramos solucionar dudas en el equipo, buscamos como poder resolverlas.\u003c/p\u003e\u003cul\u003e\u003cli\u003eBrindis grupal y un día libre de cumpleaños (a elección el día).\u003c/li\u003e\u003cli\u003eCódigo de vestimenta: Casual - Informal\u003c/li\u003e\u003cli\u003eSalidas grupales a almuerzo y asados.\u003c/li\u003e\u003cli\u003eCervezas los viernes para relajarse después de una semana de trabajo\u003c/li\u003e\u003cli\u003eSin horarios rígidos\u003c/li\u003e\u003cli\u003eOficinas ubicadas en metro Manuel Montt\u003c/li\u003e\u003cli\u003eCafe Italiano\u003c/li\u003e\u003cli\u003eComedor y área de esparcimiento.\u003c/li\u003e\u003c/ul\u003e","remote":false,"city":"Santiago","country":"Chile","country_flag_url":"https://d2dgum4gsvdsrq.cloudfront.net/assets/flags/cl_mini-43732ca1dce0306aebced22a6205cb8bab0d2747005d1154a045776ba5aea7a9.png","new":false,"seniority":"Semi Senior","logo_url":"https://getonbrd-prod.s3.amazonaws.com/uploads/users/logo/2893/ipsum_aquare__1_.png","url":"/empleos/programacion/back-end-developer-ipsum-santiago","modality":"Full time","published_at":"jun 27","company":{"name":"IPSUM","about":"Revolucionando la industria de la ingeniería y construcción por medio de la tecnología. Tenemos una plataforma web y móvil colaborativa all-in-one para planificación y gestión y  de proyectos.  3 años de vida, varios clientes en Chile y Latinoamérica.","url":"/companies/ipsum"}},{"id":"full-stack-developer-garage-labs-santiago","title":"Full-Stack Developer","recommended":false,"pinned":false,"is_hot":true,"salary":"1000 - 2500","description":"\u003cp\u003eEn Garage Labs tenemos sólo dos requisitos excluyentes para todo integrante de nuestro equipo:\u003c/p\u003e\u003col\u003e\u003cli\u003e\u003cstrong\u003eGanas y capacidad para estar constantemente aprendiendo nuevas tecnologías y formas de trabajar\u003c/strong\u003e. Cualquier persona con el background técnico necesario (como capacidad analítica, nociones de metodologías ágiles, algoritmos y estructuras de datos) puede aprender sin problemas las herramientas y tecnologías que utilizamos, por lo que no consideramos a ninguna de ellas como excluyente\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eSaber trabajar en equipo\u003c/strong\u003e. Si bien Garage Labs es un único gran equipo, nos dividimos en células de trabajo más pequeñas que llevan a cabo cada uno de nuestros desarrollos y proyectos de forma autónoma. Dado que todos los equipos son multidisciplinarios, es necesario saber cómo comunicar adecuadamente las ideas y dudas a personas con diferentes perfiles de conocimiento, así como también es importante la asertividad al momento de hacer críticas y autocríticas. Además, es muy importante fomentar la buena onda y compañerismo dentro de cada equipo, para que trabajar sea una grata experiencia para todos.\u003c/li\u003e\u003c/ol\u003e\u003cp\u003eNuestro stack de tecnologías se basa en Ruby On Rails (versiones 4+ y 5+), por lo que es importante conocer el patrón MVC y sus derivados, pero no es necesario tener amplia experiencia en el uso del framework RoR (eso es algo que se puede aprender). \u003c/p\u003e\u003cp\u003eOfrecemos la opción de formar parte de nuestro equipo en modo Trainee mientras aprendes todo lo que alguien Full Stack Developer de nuestro equipo debe manejar. En este caso el sueldo inicial es más bajo, pero una vez alcanzado el nivel esperado este se equipara al del resto del equipo.\u003c/p\u003e\u003cp\u003eSi te gustaría trabajar en un ambiente laboral relajado pero lleno de desafíos profesionales, Garage Labs es el lugar indicado.\u003c/p\u003e","functions":null,"benefits":"\u003cp\u003eEn Garage Labs estamos convencidos de que no existe el alto rendimiento en ambientes estresantes, por lo que nos preocupamos de tener (y mantener) un grato ambiente laboral, lleno de buena onda, humor y compañerismo. Para cumplir con esto, ofrecemos:\u003c/p\u003e\u003col\u003e\u003cli\u003eTrabajo orientado al cumplimiento de objetivos\u003c/li\u003e\u003cli\u003eHorario flexible\u003c/li\u003e\u003cli\u003ePosibilidad de hacer Home Office las veces que creas necesario\u003c/li\u003e\u003cli\u003eEstacionamiento de bicis y duchas\u003c/li\u003e\u003cli\u003ePoder venir a trabajar con la ropa que quieras. Salvo cuando haya reuniones con clientes (en ningún caso terno o taco alto, por si acaso)\u003c/li\u003e\u003cli\u003eCafé y té ilimitados (próximamente también cervezas y Red Bull)\u003c/li\u003e\u003cli\u003eMuchos espacios diferentes para trabajar, además de tu puesto dentro de la oficina. Puede ser en la terraza para más comodidad o en el patio zen para mayor concentración\u003c/li\u003e\u003cli\u003eMuchas excusas para celebrar con un asado en la oficina (tenemos parrilla y una terraza ad-hoc para tales fines) o para ir a La Burguesía (si hay antojo de hamburguesas) o al Honesto Mike (si hay antojo de cervezas)\u003c/li\u003e\u003c/ol\u003e","remote":false,"city":"Santiago","country":"Chile","country_flag_url":"https://d2dgum4gsvdsrq.cloudfront.net/assets/flags/cl_mini-43732ca1dce0306aebced22a6205cb8bab0d2747005d1154a045776ba5aea7a9.png","new":false,"seniority":"Sin experiencia","logo_url":"https://getonbrd-prod.s3.amazonaws.com/uploads/users/logo/6904/gl_get.png","url":"/empleos/programacion/full-stack-developer-garage-labs-santiago","modality":"Full time","published_at":"feb 27","company":{"name":"Garage Labs","about":"En Garage Labs nos dedicamos a desarrollar e implementar increíbles soluciones de software para empresas. A través del uso de metodologías ágiles nos encargamos de apoyar a nuestros clientes en el proceso de transformación digital.","url":"/companies/garage-labs"}},{"id":"ingeniero-de-soporte-devops-open-green-road-santiago","title":"Full-Stack Developer","recommended":false,"pinned":false,"is_hot":false,"salary":"1800 - 2500","description":"\u003cp\u003eRequerimos un desarrollador con experiencia en Ruby On Rails 4 o superior, algún framework frontend, preferentemente Angular 2+ o afín (React, Vue), conocimiento de CSS/SCSS, manejo de bases de datos en particular MySQL y manejo de herramientas de control de versiones como Git.\u003c/p\u003e\u003cp\u003eDe manera deseable pero no menos importante, experiencia en infraestructuras AWS tales como EC2, Elastic Beanstalk, RDS, S3 y Route53; conocimientos en bases de datos no relacionales tales como MongoDB, experiencia en herramientas de control de incidencias tales como Trello y Jira, y metodologías ágiles. Si no estás tan familiarizado con estas tecnologías no te preocupes, pues hay espacio para el aprendizaje!\u003c/p\u003e\u003cp\u003eAdicionalmente formaras parte de nuestro equipo de desarrollo, por lo que el trabajo en equipo es bastante apreciado. Por otro lado valoramos también la pro-actividad y las ganas de aprender, como así las ganas de enseñar.\u003c/p\u003e","functions":null,"benefits":"\u003cul\u003e\u003cli\u003eTenida casual\u003c/li\u003e\u003cli\u003eCinco días administrativos al año para que hagas tus trámites.\u003c/li\u003e\u003cli\u003eHorario flexible\u003c/li\u003e\u003cli\u003eSeguro de salud Metlife\u003c/li\u003e\u003cli\u003eContrato Indefinido\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eTe esperamos!\u003c/p\u003e","remote":false,"city":"Santiago","country":"Chile","country_flag_url":"https://d2dgum4gsvdsrq.cloudfront.net/assets/flags/cl_mini-43732ca1dce0306aebced22a6205cb8bab0d2747005d1154a045776ba5aea7a9.png","new":false,"seniority":"Junior","logo_url":"https://getonbrd-prod.s3.amazonaws.com/uploads/users/logo/6702/original2-rgb.png","url":"/empleos/programacion/ingeniero-de-soporte-devops-open-green-road-santiago","modality":"Full time","published_at":"dic 05","company":{"name":"Open Green Road","about":"Empresa de software que trabaja en ámbitos educativos conocida en Chile por Puntaje Nacional.","url":"/companies/ingenieria-de-sistemas-open-green-r"}},{"id":"desarrollador-front-end-beetrack","title":"Desarrollador Front-end","recommended":false,"pinned":false,"is_hot":true,"salary":"1400 - 2300","description":"\u003cp\u003e\u003cstrong\u003ePerfil Desarrollador para Beetrack\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEn Beetrack buscamos a un \u003cstrong\u003eDesarrollador Junior o Semi senior\u003c/strong\u003e; con conocimientos en JavaScript (idealmente manejo de ES6), que quiera seguir aprendiendo para usar el stack de desarrollo de React.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAlgunas responsabilidades que destacamos:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eExperiencia básica en JavaScript (al menos 1 año de experiencia).\u003c/li\u003e\u003cli\u003eExperiencia básica en hojas de estilo (SASS).\u003c/li\u003e\u003cli\u003eExperiencia trabajando con Git.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eDeseables:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eIdealmente tener experiencia con JavaScript ES6.\u003c/li\u003e\u003cli\u003eIdealmente tener experiencia en React y Redux.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eSobre nuestro stack y metodologías:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eNuestras tecnologías son Rails, MySQL, MongoDB, Redis, React + Redux. Todo en AWS.\u003c/p\u003e","functions":null,"benefits":"\u003cp\u003eOtros beneficios y ventajas:\u003c/p\u003e\u003cul\u003e\u003cli\u003eTenemos una oficina ubicada muy cerca del Metro Manquehue con instalaciones de gran calidad.\u003c/li\u003e\u003cli\u003ePuedes venir vestido en short y polera si así lo prefieres.\u003c/li\u003e\u003cli\u003eTenemos snacks, frutas, bebidas y café gratis.\u003c/li\u003e\u003cli\u003eHay premios trimestrales por cumplimiento de metas.\u003c/li\u003e\u003c/ul\u003e","remote":false,"city":"Santiago","country":"Chile","country_flag_url":"https://d2dgum4gsvdsrq.cloudfront.net/assets/flags/cl_mini-43732ca1dce0306aebced22a6205cb8bab0d2747005d1154a045776ba5aea7a9.png","new":false,"seniority":"Junior","logo_url":"https://getonbrd-prod.s3.amazonaws.com/uploads/users/logo/2244/vertical-sinslogan.png","url":"/empleos/programacion/desarrollador-front-end-beetrack","modality":"Full time","published_at":"jun 18","company":{"name":"Beetrack","about":"Beetrack es un servicio de tracking de despachos. A diferencia del típico GPS, nosotros nos enfocamos en monitorear la carga que lleva un camión, dándole al cliente final una mejor visibilidad de lo que pasa con sus despachos.","url":"/companies/beetrack"}}]}